{
  "agenda":[
    {
      "id": 1,
      "name": "Aliaksander Stsepaniuk",
      "subject": "Effective CPU",
      "description": "Современный микропроцессор – весьма сложное и высокотехнологичное устройство. Множество учёных и инженеров трудятся над тем, чтобы сделать микропроцессоры настолько эффективными, насколько это возможно: исполнять код максимально быстро, тратить как можно меньше энергии и выполнять программы, написанные ещё в 80-х.\nВнутренняя сложность микропроцессора максимально абстрагирована от прикладного программиста самим процессором и разработчиками компиляторов. Но всё же знание некоторых принципов работы может помочи писать более эффективный код и избежать некоторых трудноуловимых ошибок.\nПредлагаю поговорить немного о том, как устроен микропроцессор и о том, как можно использовать эти знания для того, чтобы заставить его максимально эффективно.",
      "image": "",
      "title": "",
      "company": "",
      "stream": ""
    },
    {
      "id": 2,
      "name": "Krystsina Kremianeuskaya",
      "subject": "Business Intelligence – работа на стыке IT и бизнеса",
      "description": "Управление компанией и принятие решений на основе большого количества постоянно меняющихся данных – одна из самых актуальных проблем современных руководителей. Я расскажу, как Business Intelligence помогает справиться с этой задачей и извлечь максимум пользы из имеющихся данных компании, а также познакомлю с инструментами Business Intelligence на примере Power BI.",
      "image": "",
      "title": "",
      "company": "",
      "stream": ""
    },
    {
      "id": 3,
      "name": "Dzmitry Nichyparuk ",
      "subject": "Designing reliable software",
      "description": "По-настоящему надежное программное обеспечение всегда скептически настроено и готово к отказам. Другие системы оно держит на расстоянии, так как слишком тесное взаимодействие может быть небезопасным. Оно не доверяет даже себе устанавливая внутренние барьеры для защиты от сбоев.",
      "image": "",
      "title": "",
      "company": "",
      "stream": ""
    },
    {
      "id": 4,
      "name": "Pavel Yukhnovich",
      "subject": "Growing as a developer",
      "description": "Do you want to upgrade yourself and become a better engineer? Just follow these tips & tricks and the result will be very rapid.",
      "image": "",
      "title": "",
      "company": "",
      "stream": ""
    },
    {
      "id": 5,
      "name": "Uladzimir Kazakevich",
      "subject": "Evaluating Software Architecture - a practical guide",
      "description": "",
      "image": "",
      "title": "",
      "company": "",
      "stream": ""
    },
    {
      "id": 6,
      "name": "Siarhei Tuzik",
      "subject": "Enterprise Orchestration",
      "description": "Что-то легкое и адаптированное под девелоперскую среду про архитектурный стиль мышления, разные профессиональные уровни, типы вовлечения и ролей в больших проектах и т.п.",
      "image": "",
      "title": "",
      "company": "",
      "stream": ""
    },
    {
      "id": 7,
      "name": "Volha Zaverach",
      "subject": "Брест e-kids: программирование с удовольствием!",
      "description": "Во время доклада будут раскрыты темы:\n- e-kids: бенефит, который нас объединяет;\n- почему все любят SCRATCH;\n- нашествие роботов в Brest e-kids;\n- тренеры e-kids Brest: кто они и как им стать;\n- детский IT мир: соревнования и опыт публичных выступлений;\n- история и перспективы e-kids в Бресте: SCRATCH в production.\n",
      "image": "",
      "title": "",
      "company": "",
      "stream": ""
    },
    {
      "id": 8,
      "name": "Aliaksandr Orgish",
      "subject": "Программисты-кентавры",
      "description": "Искусственный интеллект",
      "image": "",
      "title": "",
      "company": "",
      "stream": ""
    },
    {
      "id": 9,
      "name": "Vitali Fokin",
      "subject": "Kubernetes 101",
      "description": "Обзор возможностей Kubernetes, зачем он нужен, кому и когда, а также немного хороших практик по развертыванию и разработке Kubernetes-powered приложений.",
      "image": "",
      "title": "",
      "company": "",
      "stream": ""
    },
    {
      "id": 10,
      "name": "Yauheni Pakala",
      "subject": ".NET Embedding",
      "description": "О возможности переиспользования существующей кодововой базы на .NET между Windows, Android и iOS в виде нативных библиотек.",
      "image": "",
      "title": "",
      "company": "",
      "stream": ""
    },
    {
      "id": 11,
      "name": "Yauheni Arkadzyeu",
      "subject": "Кто такой Mixed QA инженер?",
      "description": "Доклад освещает отличия Mixed QA инженера от Manual QA и Automation TA, а также преимущества присутствия Mixed QA на проекте.",
      "image": "",
      "title": "",
      "company": "",
      "stream": ""
    },
    {
      "id": 12,
      "name": "Yauheni Semianiuk",
      "subject": "Почувствуй разницу в тестировании программного обеспечения",
      "description": "Тестирование - как много понимают под этим словом. При этом, каждый раз вас будут убеждать в том, что вы что-то делаете не так. Так как же всё-таки делать это правильно? Как тестируют разные продуктовые и аутсорсинг компании? В чем плюсы и минусы различных процессов тестирования? Как это работает в EPAM? Ответы на эти и другие вопросы вы узнаете в этом докладе.",
      "image": "",
      "title": "",
      "company": "",
      "stream": ""
    },
    {
      "id": 13,
      "name": "Dzianis Baranau",
      "subject": "Key-word Driven подход в Автоматизированном Тестировании",
      "description": "Решение, которое позволяет создавать UI автомейшн тесты человеку без специфических технических скилов и НЕ отвлекаться на рутинные таски (апдейт тест кейсов, ран регрессии в бэкграунде, сбор статистики).",
      "image": "",
      "title": "",
      "company": "",
      "stream": ""
    }
  ]
}
